#include <stdio.h>

// 从1开始，按顺时针顺序铺开的5x5螺旋矩阵如下所示
//  21 22 23 24 25
//  20  7  8  9 10
//  19  6  1  2 11
//  18  5  4  3 12
//  17 16 15 14 13
//  可以看出 该数阵对角线上的数之和是101
//  考虑以同样方式构成的1001 x 1001 螺旋数阵 其对角线上的数之和是多少
//
//  规律
//  1. 第n圈的矩阵边长为m=2*n-1
//  2. 第n圈的矩阵右上角的值为m*m
//  3. 根据2点观察，可知：
//      左上角为 m*m-m+1, 左下角 m*m-2*m+2
//      右下角为 m*m-3*m+3
//  4. 每一圈上四个角的值相加和为：4*m*m-6*m+6

int main()
{
    int sum = 1;
    for(int m = 3; m <= 1001; m += 2)
    {
        sum += 4 * m * m - 6 * m + 6;
    }
    printf("%d\n",sum);
    return 0;
}

