/*************************************************************************
	> File Name: 25.包裹托运.c
	> Author: 
	> Mail: 
	> Created Time: Mon 18 Sep 2023 09:50:35 PM CST
 ************************************************************************/

#include<stdio.h>

// 某邮局托运包裹的运费标准是：包裹重量不大于15公斤时，每公斤6元 超过15公斤后 超过的部分每公斤9元 给定包裹重量 x 计算邮费应为多少元

int main()
{
    double x;
    printf("请输入包裹的重量\n");
    while(~scanf("%lf",&x))
    {
        printf("邮费 = %0.2lf\n",x>15? 15*6 + (x-15)*9:x*6);
    }

    return 0;
}
