/*************************************************************************
	> File Name: 28.一个月有几天.c
	> Author: 
	> Mail: 
	> Created Time: Mon 18 Sep 2023 10:20:05 PM CST
 ************************************************************************/

#include<stdio.h>

// 输入两个整数 y m 表示年份和月份 输出 y 年 m 月的天数

int main()
{
    int y,m;
    printf("输入几年几月\n");
    while(~scanf("%d%d",&y,&m))
    {
        int n;
        int arr[12] = {31,28,31,30,31,30,31,31,30,31,30,31}; 
        n = arr[m-1];
        if((y % 4 == 0 && y % 100 != 0) || y % 400 ==0 && m == 2) n = 29;
        printf("%d年%d月有%d天\n",y,m,n);
    }
    return 0;
}
