/*************************************************************************
	> File Name: 16.计算各位的和.c
	> Author: 
	> Mail: 
	> Created Time: Sun 17 Sep 2023 02:09:46 PM CST
 ************************************************************************/

#include<stdio.h>

//输入一个不超过 10000 的整数 n 计算它每一位上的数字总和

int main()
{
    int n;
    printf("输入一个数字\n");
    while(~scanf("%d",&n))
    {
        int sum = 0;
        while(n>0)
        {
            sum += n%10; 
            n /= 10;
        }
        printf("各个位数的和 = %d\n",sum);
    }
    return 0;
}
