/*************************************************************************
	> File Name: 41.高利贷.c
	> Author: 
	> Mail: 
	> Created Time: Sun 24 Sep 2023 12:36:48 PM CST
 ************************************************************************/

//某人贷款10000元，第一个月过后此人需要还10000 *(1+6%) = 10600 元 第二个月需要还
//10600 * （1+6%) = 11236元 如此计算下去 该人借高利贷 x元 求n个月后此人需要还多少钱

#include<stdio.h>

int main()
{
    int x,n;
    printf("输入两个数\n");
    while(~scanf("%d%d",&x,&n))
    {
        int sum = x;
        for(int i=0; i<n; i++)
        {
            sum = sum * (1 + 0.06);
        }
        printf("需要偿还%d元\n",sum);
    }
    return 0;
}
